In [2]:
import torch
import mlflow
import numpy as np

print(f"PyTorch: {torch.__version__}")
print(f"MLflow: {mlflow.__version__}")
print(f"NumPy: {np.__version__}")
print("All libraries loaded successfully!")

PyTorch: 2.5.1
MLflow: 2.9.2
NumPy: 1.26.4
All libraries loaded successfully!

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/raw/names.csv')

In [3]:
df.shape

(2085158, 4)

In [4]:
df.head()

   Year       Name Gender  Count
0  1883       Mary      F   8012
1  1883       Anna      F   3306
2  1883       Emma      F   2367
3  1883  Elizabeth      F   2255
4  1883     Minnie      F   2035

In [5]:
df = df[['Name']]
df.head()

        Name
0       Mary
1       Anna
2       Emma
3  Elizabeth
4     Minnie

In [6]:
df.shape

(2085158, 1)

In [7]:
df.duplicated().sum()

1982709

In [8]:
df = df.drop_duplicates()

In [9]:
df.head()

        Name
0       Mary
1       Anna
2       Emma
3  Elizabeth
4     Minnie

In [10]:
df.shape

(102449, 1)

In [11]:
df.to_csv("../data/processed/names_group3.txt", index=False, sep="\t")

In [1]:
# read in all the words
words = open("../data/processed/names_group3.txt", 'r').read().splitlines()
words[:100]

['Name',
 'Mary',
 'Anna',
 'Emma',
 'Elizabeth',
 'Minnie',
 'Margaret',
 'Bertha',
 'Ida',
 'Annie',
 'Clara',
 'Alice',
 'Sarah',
 'Grace',
 'Florence',
 'Martha',
 'Ella',
 'Nellie',
 'Bessie',
 'Laura',
 'Ethel',
 'Carrie',
 'Maude',
 'Mabel',
 'Cora',
 'Gertrude',
 'Lillian',
 'Jennie',
 'Hattie',
 'Pearl',
 'Mattie',
 'Edith',
 'Eva',
 'Rose',
 'Julia',
 'Helen',
 'Catherine',
 'Myrtle',
 'Louise',
 'Lillie',
 'Jessie',
 'Edna',
 'Lena',
 'Lula',
 'Ada',
 'Frances',
 'Josephine',
 'Fannie',
 'Lucy',
 'Maggie',
 'Daisy',
 'Dora',
 'Agnes',
 'Marie',
 'Blanche',
 'Nora',
 'Katherine',
 'May',
 'Mamie',
 'Stella',
 'Effie',
 'Rosa',
 'Ellen',
 'Lizzie',
 'Nettie',
 'Elsie',
 'Della',
 'Susie',
 'Maud',
 'Sadie',
 'Mae',
 'Nancy',
 'Sallie',
 'Flora',
 'Ruth',
 'Lydia',
 'Lottie',
 'Addie',
 'Katie',
 'Alma',
 'Etta',
 'Emily',
 'Harriet',
 'Viola',
 'Georgia',
 'Susan',
 'Caroline',
 'Nannie',
 'Lulu',
 'Mollie',
 'Kate',
 'Olive',
 'Charlotte',
 'Kathryn',
 'Amanda',
 'Eliza',
 'Willie',
 'Amelia',
 'Belle',
 'Esther']

In [14]:
len(words)

102450